[
  {
    "name": "Juan Wah",
    "location": "Austin, TX",
    "text": "I was referred to Jim and Andrea, and from the beginning Jim was friendly and patient answering all my questions, as well as providing some helpful insight as to my best options. During the process, they were attentive and updated me as much as possible, so I wasn't in the dark. At closing, Jim and Andrea personally showed up to make sure everything went well, and that I was taken care of. Super sweet people that do good work."
  },
  {
    "name": "Bradley Walters",
    "location": "Houston, TX",
    "text": "My Realtor recommended Jim to me, and we connected and everything was very smooth buying our new home. They truly made that part of the purchase a pleasure. I qualified for a low rate for 30 years VA Loan and it locked in way under the current rate now. I could not be more satisfied and happy with Counselors Mortgage and their communication with the Title Company. I strongly recommend Jim for anyone looking for a new home or selling a home in Houston Texas."
  },
  {
    "name": "Alex Sitzman",
    "location": "Austin, TX",
    "text": "I have worked with Counselors Mortgage to refinance a duplex near UT and to buy a house in south Austin. I got great rates in both cases and the processes were smooth and painless. They have a good Dropbox-based system for managing the documents one must submit, which made it easy to keep everything straight. For the home loan, I wanted to close a week early and Counselors Mortgage made it happen with time to spare. As a bonus, during the closing process, the unexpected Brexit vote result was announced and the rates dropped a bit in the days after; Counselors Mortgage moved quickly and locked in a lower rate! Thanks guys!"
  },
  {
    "name": "Adam Peterson",
    "location": "Austin, TX",
    "text": "Jim is outstanding at what he does. We switched to Jim from another mortgage company that was turning our home-buying experience into a nightmare. Jim was patient, thorough, and bent over backwards to move quickly on everything we needed to close on our home. Jim's staff is excellent and they obviously care about their clients outside the scope of their business. I would recommend Jim and Counselors Mortgage to anybody, anywhere, any time. "
  },
  {
    "name": "Soheeni Vasanjee",
    "location": "Round Rock, TX",
    "text": "Andrea, I just want to take a moment to let you know that you have been awesome in helping us get our paperwork in order. Although we are not done yet, the process has been pretty smooth and I appreciate your quick correspondence. Thanks for everything!!!"
  },
  {
    "name": "Lee Ann Alexander",
    "location": "Austin, TX",
    "text": "Andrea, I want to thank you for all that you and Jim did to help ensure that the purchase of my new home went smoothly. You were incredibly helpful, and I really appreciate how quickly and thoroughly you always answered my questions. I will recommend you to everyone who needs help with a home loan. You were truly wonderful. Thank you."
  },
  {
    "name": "Daniel Ventura",
    "location": "Austin, TX",
    "text": "Great news about the funding, Andrea! This process was very painless indeed."
  },
  {
    "name": "Rinita Laud and Kwami Roberts",
    "location": "Houston, TX",
    "text": "Jim and Andrea have been absolutely remarkable through every step of this process. They explained everything to us in great detail, worked late hours to get us the house and really went above and beyond. They came highly recommended and we can see why."
  },
  {
    "name": "Jay and Julia Walker",
    "location": "Austin, TX",
    "text": "Our experience with Jim and Andrea was terrific, we could not have asked for a better service. We have already referred your company and will continue to do so. Thank you very much!"
  },
  {
    "name": "Thomas and Susanne Ince",
    "location": "Austin, TX",
    "text": "Jim & Andrea, We are settled in to our new home and loving it! I just want you both to know how much we appreciate your help. You were both wonderful to work with and we especially want to thank you for your speed throughout the process!"
  },
  {
    "name": "Randy and Hattie Bolden",
    "location": "Austin, TX",
    "text": "Andrea, Jim, Thank you very much for your great work in processing and executing our refinancing with a great rate. You have, as you always do, impress Hattie and I with your abilities and warm customer focus. Thank you."
  },
  {
    "name": "Ron Seay",
    "location": "Austin, TX",
    "text": "Jim is a great mortgage broker and I have had tremendous success working with him on multiple transactions in the past. He has done work for both my personal residence and my investment properties and was able to exceed my expectations in every transaction! Jim is an expert in his field and he delivers results."
  },
  {
    "name": "Craig Robinson",
    "location": "Austin, TX",
    "text": "Jim provided my wife and I with an excellent refinance option on our house. The best part was that it was obvious that Jim really cared about getting us into the best offering for the situation we were in at the time. He was very free with his time to discuss our options and provide us with extensive information. I have recommended him to many family members and friends and have always heard positive things back."
  },
  {
    "name": "Betty Zoeller",
    "location": "San Antonio, TX",
    "text": "Mr. Walker and his wife, Andrea, made the process so simple. I was to the point where I could no longer afford to live in my own home. Mr. Walker was able to work through my legal and title issues and get a reverse mortgage which allowed me to pay off all of my debt and eliminate my mortgage payment. I can now afford to live in the home my husband and I built to be near our children and grandchildren. I highly recommend Mr. Walker."
  },
  {
    "name": "Julie Coskey",
    "location": "Frisco, TX",
    "text": "Everything went really smoothly, especially since we did everything long distance. Jim kept us updated on how things progressed through the entire process. I will be sure to refer Jim’s team to anyone I know who is looking to buy a house or refinance. Thanks!"
  },
  {
    "name": "Alex Sitzman",
    "location": "Austin, TX",
    "text": "Jim’s team’s speed, accuracy and professionalism made getting a great home mortgage quick and painless."
  },
  {
    "name": "Eric and Staci Frey",
    "location": "Austin, TX",
    "text": "Jim’s team communicated well with us and kept us informed of all that was happening during the loan process. Jim took the time to hear our concerns and needs and to provide the information that would help us make a wise decision. They had every document in order and made sure the process went smoothly."
  }
]
